export const COMPONENT_TOOLTIP_TEXT = {
  v:
    'Большинство заклинаний требуют произношения таинственных слов.' +
    '\nСами по себе слова не являются источником силы заклинания; просто комбинация звуков с особой' +
    'тональностью вызывает резонанс в прядях магии, приводя их в движение.' +
    '\nТаким образом, персонаж с кляпом во рту или в области заклинания тишина, не может активировать' +
    ' заклинания с вербальным компонентом.',
  s:
    'Заклинание может требовать энергичной жестикуляции или замысловатой последовательности' +
    ' телодвижений.\nЕсли у заклинания есть соматический компонент, у заклинателя должна быть' +
    ' свободной хотя бы одна рука для исполнения этих жестов.',
  m:
    'У заклинателя должна быть одна свободная рука для доступа к материальным компонентам,' +
    ' но это может быть та же самая рука, что используется для выполнения соматического компонента.' +
    '\nПерсонаж может использовать мешочек с компонентами или заклинательную фокусировку вместо' +
    ' указанных компонентов. Однако, если для компонента указана цена, у персонажа для накладывания' +
    ' заклинания должен быть именно такой компонент.',
};
