export const COMPONENT_TOOLTIP_TEXT = {
  category:
    'Черта принадлежит к категории, которая указана в черте. ' +
    '\nЕсли вам сказано выбрать черту из определённой категории (например, категории происхождения),' +
    '\n то эта категория должна быть указана под названием черты. Если вам сказано выбрать черту и категория не указана,' +
    '\n то вы можете выбрать любую категорию.',
  prerequisite:
    'Чтобы взять черту, вы должны соответствовать всем предварительным требованиям, указанным в её описании,' +
    '\n если только какая либо особенность не позволяет вам взять черту без этого условия. ' +
    '\n Если предварительное условие включает класс, то у вас должен быть как минимум 1 уровень в этом классе, чтобы взять черту.',
};
