// constants/dnd-tables.ts
export const SPELL_SLOTS_TABLE = [
  [0, 0, 0, 0, 0, 0, 0, 0, 0], // 0 уровень
  [2, 0, 0, 0, 0, 0, 0, 0, 0], // 1 уровень
  [3, 0, 0, 0, 0, 0, 0, 0, 0], // 2 уровень
  [4, 2, 0, 0, 0, 0, 0, 0, 0], // 3 уровень
  [4, 3, 0, 0, 0, 0, 0, 0, 0], // 4 уровень
  [4, 3, 2, 0, 0, 0, 0, 0, 0], // 5 уровень
  [4, 3, 3, 0, 0, 0, 0, 0, 0], // 6 уровень
  [4, 3, 3, 1, 0, 0, 0, 0, 0], // 7 уровень
  [4, 3, 3, 2, 0, 0, 0, 0, 0], // 8 уровень
  [4, 3, 3, 3, 1, 0, 0, 0, 0], // 9 уровень
  [4, 3, 3, 3, 2, 0, 0, 0, 0], // 10 уровень
  [4, 3, 3, 3, 2, 1, 0, 0, 0], // 11 уровень
  [4, 3, 3, 3, 2, 1, 0, 0, 0], // 12 уровень
  [4, 3, 3, 3, 2, 1, 1, 0, 0], // 13 уровень
  [4, 3, 3, 3, 2, 1, 1, 0, 0], // 14 уровень
  [4, 3, 3, 3, 2, 1, 1, 1, 0], // 15 уровень
  [4, 3, 3, 3, 2, 1, 1, 1, 0], // 16 уровень
  [4, 3, 3, 3, 2, 1, 1, 1, 1], // 17 уровень
  [4, 3, 3, 3, 3, 1, 1, 1, 1], // 18 уровень
  [4, 3, 3, 3, 3, 2, 1, 1, 1], // 19 уровень
  [4, 3, 3, 3, 3, 2, 2, 1, 1], // 20 уровень
] as const;

export const MAX_CHARACTER_LEVEL = 20 as const;

export const MIN_CHARACTER_LEVEL = 1 as const;

export const SPELL_LEVELS_COUNT = 9 as const;
