export const COMPONENT_TOOLTIP_TEXT = {
  abilityScores:
    'Черта принадлежит к категории, которая указана в черте. ' +
    '\nЕсли вам сказано выбрать черту из определённой категории (например, категории происхождения),' +
    '\n то эта категория должна быть указана под названием черты. Если вам сказано выбрать черту и категория не указана,' +
    '\n то вы можете выбрать любую категорию.',
  abilities:
    'В предыстории перечислены 3 из ваших характеристик персонажа.' +
    '\nУвеличьте одну из них на 2, а другую на 1; или увеличьте каждую из 3 на 1.',
  feat: 'Предыстория даёт вам определённую черту из категории происхождения.',
  skills:
    'Предыстория даёт вашему персонажу владение 2 определёнными навыками.',
  tool:
    'Каждая предыстория даёт персонажу владение 1 инструментом' +
    '\n - либо конкретным инструментом,' +
    '\n либо одним из инструментов ремесленника на выбор.',
};
