import type { GreetingsCharacter } from '../model';

export const GREETINGS_CHARACTERS: Array<GreetingsCharacter> = [
  {
    image: '/s3/home/greetings/greeter.webp',
    messages: [
      'Смотри-ка, новый паладин правил! Брось на харизму, чтобы не утонуть в деталях.',
      'Смелый шаг, смертный! Без +5 к интеллекту тут легко заблудиться в таблицах.',
      'Эй, герой, раздел классов в работе, как заклинание архимага — долго готовится, но эффект будет легендарным!',
      'О, авантюрист знаний! Надеюсь, у тебя есть зелье концентрации для этих страниц.',
      'Ты здесь, чтобы стать мастером игры? Без спас-броска на разум не обойтись!',
      'О, ещё один искатель приключений? Берегись ловушек в правилах — они коварны!',
      'О, новичок в лабиринте правил? Надеюсь, у тебя есть карта и пара кубиков!',
      'Так, искатель истины, проверим твой модификатор внимания перед чтением этой главы.',
      'Ты открыл верный том! Осталось бросить на мудрость, чтобы осознать, что происходит.',
      'Секретный квест: прочесть три абзаца и не крикнуть “кастую файерболл по тексту!”.',
      'Если здесь стало темно — это не настройка, это атмосфера.',
      'Тебе показалось двусмысленно? Отлично, значит, работает.',
      'Смелый план. Сначала читать, потом понимать.',
      'Собрался спорить с формулировкой? Очки харизмы положил на стол — и поехали.',
      'Ты сейчас киваешь, будто понял. Хочешь кинем проверку на это?',
    ],
  },
  {
    image: '/s3/home/greetings/greeter2.webp',
    messages: [
      'Вперед, легенда начинается здесь!',
      'Ворвался в мир подвигов? Брось d20 на отвагу и начни свою великую сагу!',
      'Новый авантюрист, мир ждёт твоих подвигов! Пусть каждый шаг будет достойным баллады барда.',
      'Впереди земли полные чудес! Хватай кубики, герой, и пиши свою историю с каждым броском.',
      'О, храбрец, готовый к квестам! Твоя судьба сияет ярче, чем древний артефакт.',
      'Добро пожаловать в мир, где рождаются герои! Твоя история начинается прямо сейчас.',
      'О, ты ждёшь раздел классов? Не волнуйся, дорогой, мы его бережно готовим, как эльфийский хлеб, и скоро он будет готов!',
      'Давай сыграем по-крупному, новичок!',
      'Судьба зовет, а я тут с подсказками!',
      'Внимание! Дальше идут тексты уровня подземелья мастера — без подготовки не входить!',
      'Не пугайся таблиц! Они выглядят страшно, но всего лишь ждут твоего спас-броска на терпение.',
      'Есть раздел как мимик: выглядит как таблица, а на деле кусает мозг.',
      'Сначала вдохновение, потом правила — иначе правила вдохновят тебя в стену.',
      'Не бойся терминов: это просто гоблины из слов, их можно победить проверкой интеллекта.',
    ],
  },
] as const;
